Repository: gorpello/GymBro
Catalog: GymBroPackage/Sources/L10n/Resources/ExerciseCatalog.xcstrings
Source language: en
Languages: es, it, zh

# upright-row.step.0
source: Stand up with a barbell in front of your thighs, hands shoulder-width apart.
es: De pie, con la barra delante de los muslos y las manos a la anchura de los hombros.
it: Stai in piedi con un bilanciere davanti alle cosce, mani alla larghezza delle spalle.
zh: 双脚开立站直，双手正握杠铃置于大腿前侧，握距与肩同宽。

# upright-row.step.1
source: Keep your chest tall and your shoulders pulled back.
es: Mantén el pecho alto y los hombros hacia atrás.
it: Tieni il petto alto e le spalle indietro.
zh: 挺胸抬头，肩部微向后收。

# upright-row.step.2
source: Pull the bar straight up along your body, leading with your elbows.
es: Sube la barra pegada al cuerpo llevando los codos por delante.
it: Tira la sbarra su lungo il corpo, guidando con i gomiti.
zh: 手肘领跑贴紧躯干，将杠铃垂直向上拉起。

# upright-row.step.3
source: Stop when your elbows reach shoulder height, no higher.
es: Para cuando los codos lleguen a la altura de los hombros, no más arriba.
it: Fermati quando i gomiti arrivano all'altezza delle spalle, non oltre.
zh: 当手肘提升至肩部高度时停止，切勿过度拉高。

# upright-row.step.4
source: Lower the bar slowly back down to your thighs.
es: Baja la barra despacio hasta los muslos.
it: Riabbassa lentamente verso le cosce.
zh: 控制杠铃缓慢贴着躯干下放回大腿前侧。

# machine-lateral-raise.name
source: Machine Lateral Raise
es: Elevaciones laterales en máquina
it: Alzate laterali alla macchina
zh: 坐姿器械侧平举

# machine-lateral-raise.step.0
source: Sit in the lateral raise machine with the pads against your outer arms.
es: Siéntate en la máquina de laterales con las almohadillas en la parte externa de los brazos.
it: Siediti alla macchina per alzate laterali con i cuscinetti contro l'esterno delle braccia.
zh: 坐在侧平举器械上，手臂外侧紧靠护肘垫。

# machine-lateral-raise.step.1
source: Set the seat so the pivot lines up with your shoulders.
es: Ajusta el asiento para que el eje quede a la altura de los hombros.
it: Regola il sedile così che il perno sia in linea con le spalle.
zh: 调节座椅高度，使器械转轴与双肩处于同一水平线。

# machine-lateral-raise.step.2
source: Push your arms out and up until they reach shoulder height.
es: Empuja los brazos hacia fuera y arriba hasta la altura de los hombros.
it: Spingi le braccia fuori e su finché arrivano all'altezza delle spalle.
zh: 三角肌中束发力将手臂向外向上推起，直至达到肩部高度。

# machine-lateral-raise.step.3
source: Keep your neck relaxed and your traps out of the movement.
es: Mantén el cuello relajado y los trapecios fuera del movimiento.
it: Tieni il collo rilassato e i trapezi fuori dal movimento.
zh: 保持颈部放松，避免斜方肌耸肩代偿。

# machine-lateral-raise.step.4
source: Lower the pads slowly back to your sides.
es: Baja las almohadillas despacio hasta los costados.
it: Abbassa lentamente i cuscinetti ai lati.
zh: 控制速度缓慢将靠垫放回身体两侧起始位置。

# landmine-press.name
source: Landmine Press
es: Press landmine
it: Spinte landmine
zh: 地雷管推举

# landmine-press.step.0
source: Wedge one end of a barbell into a landmine holder or a corner.
es: Encaja un extremo de la barra en el soporte landmine o en una esquina.
it: Incastra un'estremità di un bilanciere in un supporto landmine o in un angolo.
zh: 将杠铃一端插入地雷管接口或固定在墙角。

# landmine-press.step.1
source: Hold the loaded end at your shoulder with one hand, standing in a split stance.
es: Sujeta el extremo cargado a la altura del hombro con una mano y un pie adelantado.
it: Tieni l'estremità caricata alla spalla con una mano, in piedi in posizione divaricata.
zh: 单手托住负重端杠铃置于同侧肩前，呈前后弓步站立。

# landmine-press.step.2
source: Brace your core and keep your ribs down.
es: Aprieta el abdomen y mantén las costillas bajas.
it: Contrai il core e tieni le costole basse.
zh: 收紧核心肌群，肋骨下沉不反弓。

# landmine-press.step.3
source: Press the bar up and forward until your arm is straight.
es: Empuja la barra hacia arriba y adelante hasta estirar el brazo.
it: Spingi il bilanciere su e in avanti finché il braccio è teso.
zh: 肩部发力沿着斜上方将杠铃推起，直至手臂完全伸直。

# landmine-press.step.4
source: Bring the bar back to your shoulder under control.
es: Devuelve la barra al hombro controlando el peso.
it: Riporta il bilanciere alla spalla sotto controllo.
zh: 控制速度将杠铃平缓降回肩部起始位置。

# pike-push-up.name
source: Pike Push-up
es: Flexiones pike
it: Piegamenti a luccio
zh: 派克俯卧撑

# pike-push-up.step.0
source: Start on your hands and feet with your hips pushed up high.
es: Empieza con manos y pies en el suelo y la cadera bien alta.
it: Parti su mani e piedi con i fianchi spinti in alto.
zh: 双手双脚撑地，将髋部高高推起成倒V字形姿势。

# pike-push-up.step.1
source: Walk your feet in so your body makes an upside-down V.
es: Acerca los pies hasta formar una V invertida con el cuerpo.
it: Avvicina i piedi così che il corpo formi una V rovesciata.
zh: 双脚向前小步移动，使身体呈现紧凑的倒V字形态。

# pike-push-up.step.2
source: Bend your elbows to lower the top of your head towards the floor.
es: Flexiona los codos para bajar la coronilla hacia el suelo.
it: Piega i gomiti per abbassare la sommità della testa verso il pavimento.
zh: 屈肘下沉身体，将头顶朝两手前方的地面方向慢慢降落。

# pike-push-up.step.3
source: Keep your hips high all the way down.
es: Mantén la cadera alta durante toda la bajada.
it: Tieni i fianchi alti per tutta la discesa.
zh: 在整个下落过程中始终保持髋部高耸。

# pike-push-up.step.4
source: Press back up until your arms are straight.
es: Empuja hacia arriba hasta estirar los brazos.
it: Spingi per tornare su finché le braccia sono tese.
zh: 双手用力推地伸直手臂，将身体推回倒V字形起始姿势。

# feet-elevated-pike-push-up.name
source: Feet-Elevated Pike Push-up
es: Flexiones pike con pies elevados
it: Piegamenti a luccio con piedi sollevati
zh: 垫高脚派克俯卧撑

# feet-elevated-pike-push-up.step.0
source: Put your feet on a bench and walk your hands back towards it.
es: Pon los pies en un banco y acerca las manos hacia él.
it: Appoggia i piedi su una panca e porta le mani indietro verso di essa.
zh: 将双脚置于健身凳上，双手手掌向后倒退靠近凳子。

# feet-elevated-pike-push-up.step.1
source: Push your hips up so your torso is almost vertical.
es: Sube la cadera hasta dejar el tronco casi vertical.
it: Spingi i fianchi in alto così che il busto sia quasi verticale.
zh: 向上推高髋部，使躯干几乎与地面垂直。

# feet-elevated-pike-push-up.step.2
source: Lower the top of your head towards the floor between your hands.
es: Baja la coronilla hacia el suelo entre las manos.
it: Abbassa la sommità della testa verso il pavimento tra le mani.
zh: 屈肘将头顶缓缓下放至双掌之间的地面方向。

# feet-elevated-pike-push-up.step.3
source: Keep your elbows pointing back and slightly out.
es: Mantén los codos apuntando atrás y un poco hacia fuera.
it: Tieni i gomiti puntati indietro e leggermente aperti.
zh: 保持手肘向后并略微向外展开。

# feet-elevated-pike-push-up.step.4
source: Press up until your arms are locked out.
es: Empuja hasta bloquear los brazos.
it: Spingi su finché le braccia sono bloccate.
zh: 双手发力推起身体，直至手臂完全伸展回到原位。

# handstand-push-up.name
source: Handstand Push-up
es: Flexiones en pino
it: Piegamenti in verticale
zh: 倒立俯卧撑

# handstand-push-up.step.0
source: Kick up into a handstand with your hands shoulder-width apart.
es: Sube al pino con las manos a la anchura de los hombros.
it: Dai uno slancio per andare in verticale con le mani alla larghezza delle spalle.
zh: 蹬地起跳进入倒立状态，双手撑地与肩同宽。

# handstand-push-up.step.1
source: Squeeze your glutes and keep your body in a straight line.
es: Aprieta los glúteos y mantén el cuerpo en línea recta.
it: Stringi i glutei e tieni il corpo in linea retta.
zh: 收紧臀肌与核心，使全身从脚尖到手掌呈笔直一线。

# handstand-push-up.step.2
source: Bend your elbows to lower your head towards the floor.
es: Flexiona los codos para bajar la cabeza hacia el suelo.
it: Piega i gomiti per abbassare la testa verso il pavimento.
zh: 屈曲手肘受控下沉身体，让头顶缓慢接近地面。

# handstand-push-up.step.3
source: Stop when the top of your head is just above the ground.
es: Para cuando la coronilla quede justo encima del suelo.
it: Fermati quando la sommità della testa è appena sopra il suolo.
zh: 当头顶悬停于地面上方微距处时停止下落。

# handstand-push-up.step.4
source: Press back up until your arms are straight.
es: Empuja hacia arriba hasta estirar los brazos.
it: Spingi per tornare su finché le braccia sono tese.
zh: 双臂发力推起全身，直至双臂重新完全伸直。

# wall-handstand-push-up.name
source: Wall Handstand Push-up
es: Flexiones en pino contra la pared
it: Piegamenti in verticale al muro
zh: 靠墙倒立俯卧撑

# wall-handstand-push-up.step.0
source: Walk your feet up a wall until you are upside down with your chest facing it.
es: Sube los pies por la pared hasta quedar boca abajo con el pecho hacia ella.
it: Cammina con i piedi sul muro finché sei a testa in giù con il petto rivolto verso di esso.
zh: 脚踏墙面向上攀爬至倒立姿势，胸腹面向墙面。

# wall-handstand-push-up.step.1
source: Set your hands a bit wider than your shoulders.
es: Coloca las manos algo más anchas que los hombros.
it: Metti le mani un po' più larghe delle spalle.
zh: 双手撑地间距略宽于双肩。

# wall-handstand-push-up.step.2
source: Bend your elbows and lower your head towards the floor.
es: Flexiona los codos y baja la cabeza hacia el suelo.
it: Piega i gomiti e abbassa la testa verso il pavimento.
zh: 屈肘下沉身体，控制头顶平稳移向地面。

# wall-handstand-push-up.step.3
source: Keep your body tight against the wall.
es: Mantén el cuerpo firme y pegado a la pared.
it: Tieni il corpo stretto contro il muro.
zh: 保持全身紧绷，维持身体紧凑贴近墙面。

# wall-handstand-push-up.step.4
source: Press back up to the starting position.
es: Empuja para volver a la posición inicial.
it: Spingi per tornare alla posizione iniziale.
zh: 双手发力将身体推起，恢复完全倒立伸展的起始位置。

# wall-walk.name
source: Wall Walk
es: Subida por la pared
it: Camminata al muro
zh: 爬墙倒立

# wall-walk.step.0
source: Lie face down with your feet against the base of a wall.
es: Túmbate boca abajo con los pies apoyados en la base de la pared.
it: Sdraiati a pancia in giù con i piedi contro la base del muro.
zh: 俯卧于地面，双脚脚后跟紧贴墙根。

# wall-walk.step.1
source: Push up and start walking your feet up the wall.
es: Empuja hacia arriba y empieza a subir los pies por la pared.
it: Spingi e inizia a camminare con i piedi su per il muro.
zh: 双手撑地推起成俯卧撑姿势，双脚开始顺着墙面向上倒踩攀爬。

# wall-walk.step.2
source: Walk your hands in towards the wall at the same time.
es: Al mismo tiempo, acerca las manos hacia la pared.
it: Cammina con le mani verso il muro allo stesso tempo.
zh: 双手同步向后方墙面小步倒退移动。

# wall-walk.step.3
source: Go up until your chest is close to the wall.
es: Sube hasta que el pecho quede cerca de la pared.
it: Sali finché il petto è vicino al muro.
zh: 持续攀爬倒退，直到身体完全竖直且胸部贴近墙面。

# wall-walk.step.4
source: Reverse the walk back down under control.
es: Deshaz el recorrido bajando de forma controlada.
it: Percorri la camminata al contrario scendendo sotto controllo.
zh: 按照原路径受控反向走下，安全回到俯卧起始位置。

# cross-body-shoulder-stretch.name
source: Cross-Body Shoulder Stretch
es: Estiramiento de hombro cruzado
it: Stretch spalle incrociato
zh: 手臂交叉肩部拉伸

# cross-body-shoulder-stretch.step.0
source: Stand or sit up tall with your shoulders relaxed.
es: De pie o sentado, ponte erguido con los hombros relajados.
it: Stai in piedi o siediti ben dritto con le spalle rilassate
zh: 挺直站立或端坐，双肩保持自然下沉放松。

# cross-body-shoulder-stretch.step.1
source: Bring one straight arm across your chest.
es: Cruza un brazo estirado por delante del pecho.
it: Porta un braccio teso davanti al petto
zh: 将一侧手臂水平横跨在胸前。

# cross-body-shoulder-stretch.step.2
source: Hook the other forearm under it and pull it closer.
es: Engancha el otro antebrazo por debajo y tira hacia ti.
it: Aggancia l'altro avambraccio sotto di esso e tiralo più vicino a te
zh: 用另一侧前臂从下方托扣住该臂，平稳向胸口拉近。

# cross-body-shoulder-stretch.step.3
source: Keep the shoulder down instead of shrugging it.
es: Mantén el hombro bajo en lugar de encogerlo.
it: Tieni la spalla bassa senza alzarla verso le orecchie
zh: 注意沉肩，切勿耸起被拉伸侧肩膀。

# cross-body-shoulder-stretch.step.4
source: Hold the stretch, then change arms.
es: Aguanta el estiramiento y cambia de brazo.
it: Tieni l'allungamento, poi cambia braccio
zh: 维持拉伸感深呼吸数秒，换另一侧手臂重复。

# battle-ropes.name
source: Battle Ropes
es: Cuerdas de batalla
it: Corde da battaglia
zh: 战绳

# battle-ropes.step.0
source: Anchor the ropes and take an end in each hand.
es: Ancla las cuerdas y coge un extremo con cada mano.
it: Fissa le funi e prendi un'estremità in ogni mano
zh: 将战绳牢固锚定在支点上，双手各握一端绳索手柄。

# battle-ropes.step.1
source: Step back until the ropes are almost tight and bend your knees.
es: Sepárate hasta dejarlas casi tensas y flexiona las rodillas.
it: Fai un passo indietro finché le funi sono quasi tese e piega le ginocchia
zh: 向后稍退至战绳留有少许松弛度，双膝微屈。

# battle-ropes.step.2
source: Sit into a quarter squat with your chest up.
es: Baja a una media sentadilla con el pecho alto.
it: Siediti in un quarto di squat con il petto alto
zh: 下蹲呈四分之一半蹲姿势，挺胸抬头收紧核心。

# battle-ropes.step.3
source: Slam the ropes up and down alternately to make waves.
es: Golpea las cuerdas arriba y abajo de forma alterna para hacer olas.
it: Sbatti le funi su e giù in modo alternato per creare onde
zh: 双手交替上下爆发力甩动战绳，使绳身形成连绵波浪。

# battle-ropes.step.4
source: Keep your core braced and the waves going for the whole set.
es: Mantén el abdomen apretado y las olas durante toda la serie.
it: Tieni il core attivo e continua a fare le onde per tutta la serie
zh: 在整组训练中始终保持核心收紧，维持波浪连续传导。

# MvQPqVW.name
source: Cable Woodchop
es: Leñador en polea
it: Woodchop al cavo
zh: 绳索伐木式

# MvQPqVW.step.0
source: Set a pulley high and stand side-on to it with your feet wide.
es: Pon la polea alta y colócate de lado a ella con los pies separados.

# MvQPqVW.step.1
source: Grab the handle with both hands above the shoulder nearest the stack.
es: Agarra el asa con las dos manos por encima del hombro más cercano a la torre.

# MvQPqVW.step.2
source: Keep your arms long and your core braced.
es: Mantén los brazos largos y el abdomen firme.

# MvQPqVW.step.3
source: Pull the handle down and across your body towards the opposite knee, turning your hips and back foot.
es: Tira del asa hacia abajo cruzando el cuerpo hasta la rodilla contraria, girando la cadera y el pie de atrás.

# MvQPqVW.step.4
source: Return the handle slowly to the top and switch sides after the set.
es: Devuelve el asa despacio arriba y cambia de lado al acabar la serie.

# CqhoytW.name
source: Smith Hip Thrust
es: Hip thrust en multipower
it: Hip thrust al multipower
zh: 史密斯臀推

# CqhoytW.step.0
source: Sit on the floor with your upper back against a bench inside the Smith machine.
es: Siéntate en el suelo con la parte alta de la espalda apoyada en un banco dentro del multipower.

# CqhoytW.step.1
source: Roll the bar over your hips and place a pad under it.
es: Coloca la barra sobre la cadera con una almohadilla debajo.

# CqhoytW.step.2
source: Plant your feet flat, about hip-width apart.
es: Apoya los pies en el suelo a la anchura de la cadera.

# CqhoytW.step.3
source: Drive through your heels to lift your hips until your body is straight from knees to shoulders.
es: Empuja con los talones para subir la cadera hasta alinear rodillas y hombros.

# CqhoytW.step.4
source: Squeeze your glutes at the top and lower your hips slowly.
es: Aprieta los glúteos arriba y baja la cadera despacio.

# IpONWYv.name
source: Dumbbell Side Bend
es: Flexión lateral con mancuerna
it: Piegamenti laterali con manubrio
zh: 哑铃体侧屈

# IpONWYv.step.0
source: Stand up straight with your feet shoulder-width apart and hold a dumbbell in one hand, letting it hang down by your side.
es: Ponte de pie con los pies a la anchura de los hombros y una mancuerna en una mano, colgando al costado.
it: Stai in piedi ben dritto con i piedi alla larghezza delle spalle e tieni un manubrio in una mano, lasciandolo pendere lungo il fianco
zh: 双脚与肩同宽直立站立，单手持一只哑铃，手臂自然下垂于体侧。

# IpONWYv.step.1
source: Keeping your back straight and your core engaged, slowly bend sideways at the waist towards the opposite side of the dumbbell, lowering the weight as far as you comfortably can.
es: Con la espalda recta y el core apretado, inclínate despacio hacia el lado contrario a la mancuerna, bajando el peso hasta donde llegues cómodo.
it: Tenendo la schiena dritta e il core attivo, piegati lentamente di lato all'altezza della vita verso il lato opposto al manubrio, abbassando il peso finché riesci comodamente
zh: 保持背部挺直、核心收紧，腰部向持哑铃一侧缓慢侧屈下放重量至舒适范围。

# IpONWYv.step.2
source: Pause for a moment, then slowly return to the starting position.
es: Aguanta un momento y vuelve despacio a la posición inicial.
it: Fai una pausa un momento, poi torna lentamente alla posizione iniziale
zh: 在动作底部稍作停顿，然后依靠对侧腹斜肌发力缓慢还原至起始站姿。

# IpONWYv.step.3
source: Repeat for the desired number of repetitions, then switch sides and repeat.
es: Repite las repeticiones que quieras y cambia de lado.
it: Ripeti per il numero di ripetizioni voluto, poi cambia lato e ripeti
zh: 完成目标次数后换另一侧重复。

# WW95auq.name
source: Cable Kneeling Crunch
es: Crunch de rodillas en polea
it: Crunch in ginocchio al cavo
zh: 绳索跪姿卷腹

# WW95auq.step.0
source: Attach a rope handle to a high pulley and kneel down facing away from the machine.
es: Engancha una cuerda a la polea alta y ponte de rodillas de espaldas a la máquina.
it: Attacca una corda a una carrucola alta e inginocchiati dando le spalle alla macchina
zh: 将绳索手把连接在高位滑轮上，背对龙门架双膝跪地。

# WW95auq.step.1
source: Hold the rope handle with both hands and place it behind your head, keeping your elbows out to the sides.
es: Sujeta la cuerda con las dos manos y colócala detrás de la cabeza, con los codos abiertos.
it: Impugna la corda con entrambe le mani e mettila dietro la testa, tenendo i gomiti aperti ai lati
zh: 双手握住绳索把手置于脑后或耳侧，双肘自然朝外。

# WW95auq.step.2
source: Keeping your hips stationary, flex your waist and crunch your torso down towards your thighs.
es: Con la cadera quieta, flexiona el tronco llevándolo hacia los muslos.
it: Tenendo i fianchi fermi, fletti la vita e piega il busto verso le cosce
zh: 固定髋部不动，腹部发力弯屈腰椎，将躯干向下卷缩朝向大腿。

# WW95auq.step.3
source: Pause for a moment at the bottom, then slowly return to the starting position.
es: Aguanta un momento abajo y vuelve despacio a la posición inicial.
it: Fai una pausa un momento in basso, poi torna lentamente alla posizione iniziale
zh: 在底部充分挤压腹肌停顿片刻，然后控制核心缓慢回落至起始位置。

# WW95auq.step.4
source: Repeat for the desired number of repetitions.
es: Repite las repeticiones que quieras.
it: Ripeti per il numero di ripetizioni voluto
zh: 重复规定次数。

# s8nrDXF.name
source: Weighted Crunch
es: Crunch con lastre
it: Crunch zavorrato
zh: 负重卷腹

# s8nrDXF.step.0
source: Lie flat on your back with your knees bent and feet flat on the ground.
es: Túmbate boca arriba con las rodillas flexionadas y los pies apoyados en el suelo.
it: Sdraiati sulla schiena con le ginocchia piegate e i piedi ben piantati a terra
zh: 仰卧平躺，双膝弯曲，双脚平踩在地面上。

# s8nrDXF.step.1
source: Hold a weight plate or dumbbell on your chest.
es: Sujeta un disco o una mancuerna sobre el pecho.
it: Tieni un disco o un manubrio sul petto
zh: 双手持杠铃片或哑铃置于胸前。

# s8nrDXF.step.2
source: Engage your abs and lift your upper body off the ground, curling forward until your shoulder blades are off the ground.
es: Aprieta el abdomen y despega el tronco del suelo, enrollándote hasta levantar las escápulas.
it: Attiva gli addominali e solleva il busto da terra, piegandoti in avanti finché le scapole si staccano da terra
zh: 收缩腹肌发力抬起上半身，向前卷腹直至肩胛骨完全离开地面。

# s8nrDXF.step.3
source: Pause for a moment at the top, then slowly lower your upper body back down to the starting position.
es: Aguanta un momento arriba y baja el tronco despacio a la posición inicial.
it: Fai una pausa un momento in alto, poi abbassa lentamente il busto per tornare alla posizione iniziale
zh: 在顶峰充分收缩腹肌停顿片刻，然后缓慢下放上半身回到起始位置。

# s8nrDXF.step.4
source: Repeat for the desired number of repetitions.
es: Repite las repeticiones que quieras.
it: Ripeti per il numero di ripetizioni voluto
zh: 重复规定次数。

# 7M66AVi.name
source: Barbell Rollerout
es: Rueda abdominal con barra
it: Rollout con bilanciere
zh: 杠铃跪姿健腹推

# 7M66AVi.step.0
source: Kneel on the floor and hold a barbell with both hands, shoulder-width apart.
es: Ponte de rodillas en el suelo y sujeta la barra con las dos manos, a la anchura de los hombros.
it: Inginocchiati sul pavimento e impugna un bilanciere con entrambe le mani alla larghezza delle spalle
zh: 双膝跪在地面上，双手与肩同宽正握装有杠铃片的杠铃杆。

# 7M66AVi.step.1
source: Roll the barbell forward, extending your arms and keeping your core engaged.
es: Rueda la barra hacia delante estirando los brazos, con el core apretado.
it: Fai rotolare il bilanciere in avanti, estendendo le braccia e tenendo il core attivo
zh: 核心绷紧，手臂向前推动杠铃滚动，身体随之向前延展。

# 7M66AVi.step.2
source: Continue rolling forward until your body is fully extended and your arms are overhead.
es: Sigue rodando hasta quedar estirado del todo, con los brazos por encima de la cabeza.
it: Continua a rotolare in avanti finché il corpo è completamente esteso e le braccia sono sopra la testa
zh: 持续向前滚动，直至身体充分伸展、手臂完全伸过头顶。

# 7M66AVi.step.3
source: Pause for a moment, then slowly roll the barbell back towards your knees, maintaining control.
es: Aguanta un momento y rueda la barra de vuelta hacia las rodillas, controlando.
it: Fai una pausa un momento, poi fai rotolare lentamente il bilanciere verso le ginocchia, mantenendo il controllo
zh: 稍作停顿，利用腹肌收缩控制节奏，平稳将杠铃拉回双膝前方。

# 7M66AVi.step.4
source: Repeat for the desired number of repetitions.
es: Repite las repeticiones que quieras.
it: Ripeti per il numero di ripetizioni voluto
zh: 重复规定次数。

# RqOtqD7.name
source: Reverse Crunch
es: Crunch inverso
it: Crunch inverso
zh: 反向卷腹

# RqOtqD7.step.0
source: Lie on your back with your arms at your sides and your knees bent.
es: Túmbate boca arriba con los brazos a los lados y las rodillas flexionadas.

# RqOtqD7.step.1
source: Lift your feet off the floor until your thighs are vertical.
es: Levanta los pies del suelo hasta que los muslos queden verticales.

# RqOtqD7.step.2
source: Curl your hips up off the floor, bringing your knees towards your chest.
es: Despega la cadera del suelo llevando las rodillas hacia el pecho.

# RqOtqD7.step.3
source: Pause at the top and squeeze your abs.
es: Aguanta arriba apretando el abdomen.

# RqOtqD7.step.4
source: Lower your hips slowly back to the floor.
es: Baja la cadera despacio hasta el suelo.

# qaZVsGk.name
source: Alternate Heel Touches
es: Toque de talones alterno
it: Toccate alternate ai talloni
zh: 交替触踵卷腹

# qaZVsGk.step.0
source: Lie flat on your back with your knees bent and feet flat on the ground.
es: Túmbate boca arriba con las rodillas flexionadas y los pies apoyados en el suelo.
it: Sdraiati sulla schiena con le ginocchia piegate e i piedi ben piantati a terra
zh: 仰卧平躺，屈膝，双脚平踩在地面上。

# qaZVsGk.step.1
source: Extend your arms straight out to the sides, parallel to the ground.
es: Estira los brazos a los lados, paralelos al suelo.
it: Estendi le braccia dritte ai lati, parallele al pavimento
zh: 双臂平放在身体两侧，略微悬空且与地面平行。

# qaZVsGk.step.2
source: Engaging your abs, lift your shoulders off the ground and reach your right hand towards your right heel.
es: Aprieta el abdomen, despega los hombros del suelo y lleva la mano derecha hacia el talón derecho.
it: Attivando gli addominali, solleva le spalle da terra e porta la mano destra verso il tallone destro
zh: 收紧腹肌，将肩胛骨抬离地面，右手向右侧延伸去触摸右脚后跟。

# qaZVsGk.step.3
source: Return to the starting position and repeat on the left side, reaching your left hand towards your left heel.
es: Vuelve a la posición inicial y repite hacia la izquierda, llevando la mano izquierda al talón izquierdo.
it: Torna alla posizione iniziale e ripeti sul lato sinistro, portando la mano sinistra verso il tallone sinistro
zh: 还原至中间起始位置，接着向左侧伸出左手去触摸左脚后跟。

# qaZVsGk.step.4
source: Continue alternating sides for the desired number of repetitions.
es: Sigue alternando lados durante las repeticiones que quieras.
it: Continua ad alternare i lati per il numero di ripetizioni voluto
zh: 左右两侧交替进行，保持节奏完成规定次数。

# EZeDVzO.name
source: Weighted Decline Sit-up
es: Abdominal declinado con lastre
it: Sit-up declinato zavorrato
zh: 下斜负重仰卧起坐
